#!/usr/bin/env python
# coding: utf-8

# In[43]:


def ramshalaka_prashnavali():    
    try:
        n = int(input("please select any number between 1 to 225: "))
        if n > 225:
            print("provide values between 1 to 225")
    except ValueError:
        print("That's not an int!")
        
    start = n
    step = 9
    code = []
    
    while True:
        code.append(n)
        n = n+step

        #print("n:" + str(n))
        #print(code)

        if n > 225:
            n = ((n-9)-225)+9
        if n == start:
            print(code)
            break


# In[45]:


ramshalaka_prashnavali()


# In[46]:


ramshalaka_prashnavali()


# In[23]:


def ramshalaka_prashnavali(n):    
    try:
        if n > 225:
            print("provide values between 1 to 225")
    except ValueError:
        print("That's not an int!")
        
    start = n
    step = 9
    code = []
    
    desc = {1:'सु',2:'प्र',3:'उ',4:'वि',5:'हो',6:'मु',7:'ग',8:'व',9:'सु',10:'नू',11:'वि',12:'घ',13:'धि',14:'इ',15:'द',
            16:'र',17:'रु',18:'फ',19:'सि',20:'सि',21:'रें',22:'वस',23:'है',24:'मं',25:'ल',26:'न',27:'ल',28:'य',29:'न',30:'अं',
            31:'सज',32:'सा',33:'ग',34:'सु',35:'कु',36:'म',37:'स',38:'ग',39:'त',40:'न',41:'ई',42:'ल',43:'धा',44:'वे',45:'नो',
            46:'त्य',47:'र',48:'न',49:'कु',50:'जो',51:'म',52:'रि',53:'र',54:'र',55:'अ',56:'की',57:'हो',58:'सं',59:'रा',60:'य',
            61:'पु',62:'सु',63:'थ',64:'सी',65:'जे',66:'इ',67:'ग',68:'म',69:'सं',70:'क',71:'रे',72:'हो',73:'स',74:'स',75:'नि',
            76:'ति',77:'र',78:'त',79:'र',80:'स',81:'इ',82:'ह',83:'व',84:'व',85:'प',86:'चि',87:'स',88:'य',89:'स',90:'तु',
            91:'म',92:'का',93:'ा',94:'र',95:'र',96:'मा',97:'मि',98:'मी',99:'म्हा',100:'ा',101:'जा',102:'हु',103:'हिं',104:'ा',105:'जू',
            106:'ता',107:'रा',108:'रे',109:'री',110:'हय',111:'का',112:'फ',113:'खा',114:'जि',115:'ई',116:'र',117:'रा',118:'पू',119:'द',120:'ल',
            121:'णि',122:'को',123:'मि',124:'गो',125:'ना',126:'म',127:'ज',128:'य',129:'ने',130:'मणि',131:'क',132:'ज',133:'प',134:'स',135:'ल',
            136:'हि',137:'रा',138:'म',139:'स',140:'रि',141:'ग',142:'द',143:'न',144:'ष',145:'म',146:'खि',147:'जि',148:'मनि',149:'त',150:'जं',
            151:'सिं',152:'मु',153:'न',154:'न',155:'कौ',156:'मि',157:'ज',158:'र',159:'ग',160:'घु',161:'ख',162:'सु',163:'का',164:'स',165:'र',
            166:'गु',167:'क',168:'म',169:'अ',170:'घ',171:'नि',172:'म',173:'ल',174:'ा',175:'न',176:'व',177:'ती',178:'न',179:'रि',180:'भ',
            181:'ना',182:'पु',183:'व',184:'अ',185:'ढा',186:'र',187:'ल',188:'का',189:'ए',190:'तु',191:'र',192:'न',193:'नु',194:'व',195:'थ',
            196:'सि',197:'हु',198:'सु',199:'म्ह',200:'रा',201:'र',202:'स',203:'हि',204:'र',205:'त',206:'न',207:'प',208:'ा',209:'ज',210:'ा',
            211:'र',212:'सा',213:'ा',214:'ला',215:'धी',216:'ा',217:'री',218:'ा',219:'ह',220:'हीं',221:'खा',222:'जू',223:'ई',224:'रा',225:'रे'}
    
    while True:
        code.append(n)
        n = n+step

        #print("n:" + str(n))
        #print(code)

        if n > 225:
            n = ((n-9)-225)+9
        if n == start:
            break
            
    chopai =[desc[i] for i in code]
    chopai.append("||"+str(n)+"||")
    chopai = ' '.join(chopai)
    
    
    #for i in code:
     #   chopai.append(desc[i])
    print(chopai)
        


# In[24]:


ramshalaka_prashnavali(1)


# In[25]:


ramshalaka_prashnavali(2)


# In[26]:


15*7


# In[27]:


ramshalaka_prashnavali(102)


# In[28]:


pwd


# In[ ]:




